
* agenda emacs
** pendientes completion - lsp etc
sin lsp andan mejor las completiones
*** css no anda
lo hice andar con el js-ts pero hay que tomarle la vuelta, anda
completion y flymake.
*** html no es funcional
*** js anda mas o menos
anda el dabbrev y mescla con elisps creo
** python no lo implemente todavia
pero anda bien el dabbrev.
luego de renegar bastante tratando de portar doom en la parte de
configuracion de lsp de python, abandone y puse eglot que funciona
bien para python, pero todavia no le encuentro el arranque a algunas cosas.
* agenda pendientes
** DONE [#A] poner en el listado de rbos total cobrado y estimado
** DONE agregar codigo a los articulos del stock
   CLOSED: [2022-09-24 Sat 20:23]
** DONE ver bug proveedores
   revisado. No habia tal bug.
** DONE explorar un tipo de boton con submenu
** DONE nuevo listado de visita clientes
   CLOSED: [2022-09-24 Sat 20:22]
** DONE nuevo enfoque en la queue de whatsapp
 hacer que primero una funcion centralizadora registre el pedido de
 envio de whatsapp en una tabla de la base de datos.
 con fecha exacta, idcliente, wapp y msg. o sea el log. y luego de ahi
 por orden vamos sacando con un campo logico de no procesado vamos
 procesando cada diez segundos.
 luego de procesado, se edita el registro con el resultado y tendremos
 un log con el resultado, failed, rejected, invalid, success.
** DONE sistema contable para las transferencias
** DONE sacar de static todos los archivos y bajarlos por cdn
** DONE refactorizar table.js - rename idem table.css
** DONE hacer una forma de mostrar o no mostrar la tabla de cuotas pagadas
en los cancelados con un icono.
hacer que cuando haya muchos registros de pago se muestre un poco y lo
demas se baje despues.
** DONE vista en Card para los que estan pagando
atrasado
** DONE listado de ultima cuota no atrasados en general
pienso que tendria que ser global para trabajar mas rapido.
** DONE vista en Card para los que cancelaron con fines de aprobacion
CLOSED: [2022-10-03 Mon 11:58]
:LOGBOOK:
- State "DONE"       from "CANCEL"     [2022-10-03 Mon 11:58]
:END:
ahora voy a hacer una vista para cuando no tienen deuda de status con
tags-addons devuelta-0 condonado-1 planpago-1
envolveria agregar campos en tabla clientes y triggers
dias de atraso
ver la posibilidad de hacer otro campo llamado atrasos y trigeriar
desde pagos a medida que se pague el atraso pero es dificil de
calcular.

** DONE contador de billetes
CLOSED: [2022-10-03 Mon 16:16]
** TODO ver de incorporar los botones a submenu
   y/o de cambiar el menu directamente a bulma menu
** TODO explorar y pasarse a bulma menu-bar
** TODO optimizaciones de emacs
*** DONE instalar version 28
*** solucionar el tema elpy
*** solucionar el tema undo
** TODO lista de control de documentos
** TODO whatsapp de imagenes
** TODO folleto automatico
** TODO ver la forma de ordenar las columnas de logwapp el datatable
aparentemente la culpa la tendria jsonify
y ponerlo accesible desde utilidades
** TODO interfase para registrar autorizaciones
   una modal en el contexto del cliente donde se registre dia y hora de la
   autorizacion, current_user, y respuesta, y se guarden automaticamente los
   status del cliente al momento, deuda, ultpago, sev, ln, llamar, seguir,
** TODO cambio de look y limpieza en general.
el cambio abarca no solo pasar de vue a alpinejs y sacar los styles de
las paginas y centralizarlos, cambiar las notificaciones a swall
wrappeada, modificar los borrados hacerlos mas seguros, cambiar los
botones, etc. muchas otras cosas que podre ir agregando.
** TODO cuadro de resultado mensual
con vista ordenada de ingresos y egresos
** TODO acceso a la ficha individual desde fichaje
** TODO hacer una columna recargo tomando la inflacion real
** TODO analizar diferenciar en pagadas las atrasadas
o sea las que se pagaron despues del vto
** TODO modificar la funcion totalizar para aceptar arg columnas
hasta ahora un paso gigante pq mediante clases en el th defino si la
columna se suma, y puedo poner al subtotal tambien las clases de los
td qeu contiene la columna.
Habria que ver si podemos definir el sistema de ordenado en forma
automatica o por class tambien y quedar con una sola forma para el usuario.
O sea una tabla con unos pocos toques mas de configuracion y queda
muchisimo mas exacta en su disposicion
Ver de hacer que si ya hay un subtotal no hagamos otro sino que
reusemos ese mismo o lo borremos primero.
Alli hice una tentativa de comprobacion si el idtable existe o no para
capturar errores, seguir con eso.
* agenda de actividad

** semana [2022-10-02 Sun]
*** [2022-10-03 Mon]
:LOGBOOK:
CLOCK: [2022-10-03 Mon 20:35]--[2022-10-03 Mon 20:57] =>  0:22
CLOCK: [2022-10-03 Mon 18:44]--[2022-10-03 Mon 20:14] =>  1:30
trabajando arduo en el totalizado
CLOCK: [2022-10-03 Mon 14:44]--[2022-10-03 Mon 16:16] =>  1:32
terminado el contador de billetes.
CLOCK: [2022-10-03 Mon 12:49]--[2022-10-03 Mon 14:35] =>  1:46
CLOCK: [2022-10-03 Mon 12:03]--[2022-10-03 Mon 12:28] =>  0:25
CLOCK: [2022-10-03 Mon 11:32]--[2022-10-03 Mon 11:58] =>  0:26
con este addtag atrasos termino la info de cancelados con funcion a
analizar una venta.
CLOCK: [2022-10-03 Mon 09:15]--[2022-10-03 Mon 11:27] =>  2:12
agregue campos en ventas y clientes para calcular el atraso del pago
final de una cuenta con sus correspondientes triggers y los subi al servidor.
:END:
*** [2022-10-02 Sun]
:LOGBOOK:
CLOCK: [2022-10-02 Sun 22:35]--[2022-10-02 Sun 23:07] =>  0:32
CLOCK: [2022-10-02 Sun 19:50]--[2022-10-02 Sun 22:33] =>  2:43
CLOCK: [2022-10-02 Sun 19:32]--[2022-10-02 Sun 19:49] =>  0:17
CLOCK: [2022-10-02 Sun 14:25]--[2022-10-02 Sun 16:57] =>  2:32
mas tuneado
CLOCK: [2022-10-02 Sun 13:40]--[2022-10-02 Sun 14:25] =>  0:45
intento instalar web-mode
CLOCK: [2022-10-02 Sun 12:10]--[2022-10-02 Sun 12:26] =>  0:16
CLOCK: [2022-10-02 Sun 11:35]--[2022-10-02 Sun 12:10] =>  0:35
CLOCK: [2022-10-02 Sun 09:20]--[2022-10-02 Sun 11:35] =>  2:15
instale todo de nuevo con la base de un sistema separado
CLOCK: [2022-10-02 Sun 09:14]--[2022-10-02 Sun 09:18] =>  0:04
empiezo el tuneado de emacs
:END:
** semana [2022-09-25 Sun]
*** [2022-10-01 Sat]
:LOGBOOK:
CLOCK: [2022-10-01 Sat 18:15]--[2022-10-01 Sat 19:04] =>  0:49
un placer volver a mi configuracion. Me faltan cosas por resolver pero
estoy mejor asi.
CLOCK: [2022-10-01 Sat 17:20]--[2022-10-01 Sat 18:14] =>  0:54
despues de renegar como enano con doom volvi a mi configuracion
CLOCK: [2022-10-01 Sat 16:55]--[2022-10-01 Sat 17:17] =>  0:22
CLOCK: [2022-10-01 Sat 13:40]--[2022-10-01 Sat 16:52] =>  3:12
renegando con web-mode todavia.
CLOCK: [2022-10-01 Sat 12:43]--[2022-10-01 Sat 13:00] =>  0:17
CLOCK: [2022-10-01 Sat 08:10]--[2022-10-01 Sat 11:29] =>  3:19
:END:
*** [2022-09-30 Fri]
:LOGBOOK:
CLOCK: [2022-09-30 Fri 16:45]--[2022-09-30 Fri 17:35] =>  0:50
listado de ultima cuota no atrasados
CLOCK: [2022-09-30 Fri 14:05]--[2022-09-30 Fri 16:45] =>  2:40
tremenda perdida/inversion de tiempo por unos ajustes no muy
satisfactorios en emacs.
CLOCK: [2022-09-30 Fri 13:40]--[2022-09-30 Fri 13:47] =>  0:07
CLOCK: [2022-09-30 Fri 12:47]--[2022-09-30 Fri 13:00] =>  0:13
CLOCK: [2022-09-30 Fri 12:05]--[2022-09-30 Fri 12:32] =>  0:27
arreglando emacs intentando infructuosamente de nuevo con eglot
CLOCK: [2022-09-30 Fri 10:27]--[2022-09-30 Fri 12:04] =>  1:37
procedo a probar los triggers de los campos nuevos de clientes
terminado de probar los triggers y adecuarlos en el server
CLOCK: [2022-09-30 Fri 08:35]--[2022-09-30 Fri 10:17] =>  1:42
terminado mostrar pagados maximo 5 y varias limpiezas mas.
CLOCK: [2022-09-30 Fri 08:21]--[2022-09-30 Fri 08:35] =>  0:14
:END:
*** [2022-09-29 Thu]
:LOGBOOK:
CLOCK: [2022-09-29 Thu 21:30]--[2022-09-29 Thu 22:29] =>  0:59
free hour arreglando emacs se rompio por littering
CLOCK: [2022-09-29 Thu 21:05]--[2022-09-29 Thu 21:13] =>  0:08
free minutes
CLOCK: [2022-09-29 Thu 19:45]--[2022-09-29 Thu 21:00] =>  1:15
nueva presentacion de tablas en el buscador
CLOCK: [2022-09-29 Thu 18:50]--[2022-09-29 Thu 19:05] =>  0:15
CLOCK: [2022-09-29 Thu 18:00]--[2022-09-29 Thu 18:50] =>  0:50
cambio de nombre a base_template
CLOCK: [2022-09-29 Thu 17:24]--[2022-09-29 Thu 17:59] =>  0:35
CLOCK: [2022-09-29 Thu 15:15]--[2022-09-29 Thu 15:35] =>  0:20
mucha optimizacion de emacs
CLOCK: [2022-09-29 Thu 14:46]--[2022-09-29 Thu 15:13] =>  0:27
CLOCK: [2022-09-29 Thu 13:12]--[2022-09-29 Thu 14:20] =>  1:08
CLOCK: [2022-09-29 Thu 12:30]--[2022-09-29 Thu 12:52] =>  0:22
terminado la refactorizacion de script.js
CLOCK: [2022-09-29 Thu 10:45]--[2022-09-29 Thu 12:29] =>  1:44
CLOCK: [2022-09-29 Thu 10:43]--[2022-09-29 Thu 10:45] =>  0:02
CLOCK: [2022-09-29 Thu 08:30]--[2022-09-29 Thu 10:42] =>  2:12
sacar de todos los archivos de static y linkear a cdn
:END:
*** [2022-09-28 Wed]
:LOGBOOK:
CLOCK: [2022-09-28 Wed 19:20]--[2022-09-28 Wed 20:32] =>  1:12
analice avy-> desechado. Reemplaze ido por ivy hay que acostumbrarse a
la forma de abrir los archivos.
CLOCK: [2022-09-28 Wed 19:09]--[2022-09-28 Wed 19:19] =>  0:10
free hour
CLOCK: [2022-09-28 Wed 15:33]--[2022-09-28 Wed 16:59] =>  1:26
hice los triggers y los campos en el servidor
falta ver de cargar el campo condonados por valor minimo de montocondonado
ya saque la condonacion de menor cuantia por redondeo <5%
CLOCK: [2022-09-28 Wed 14:21]--[2022-09-28 Wed 15:16] =>  0:55
reclasificamos el tag condonado para condonados por redondeo.
proceso campos nuevo en la base de datos: tarea delicada.
CLOCK: [2022-09-28 Wed 13:23]--[2022-09-28 Wed 14:20] =>  0:57
CLOCK: [2022-09-28 Wed 11:06]--[2022-09-28 Wed 12:54] =>  1:48
me hizo renegar un monton el alineamiento de los tags. Hasta que pude
resolverlo gracias a la instalacion del browser epiphany que es muy
bueno.
CLOCK: [2022-09-28 Wed 10:00]--[2022-09-28 Wed 10:50] =>  0:50
vista para los que estan pagando
correccion del bug Cornejo Alejandra: cancelo en 2021 y tiene alli su
ultpago pero compro ahora y su pmovto es 2022
CLOCK: [2022-09-28 Wed 08:39]--[2022-09-28 Wed 09:42] =>  1:03
saque irritante msg cuando no hay deuda y puse grande sin deuda
saque irritante pmovto viejo cuando esta cancelado
hice que sin comentarios sea un link que lleve abajo
CLOCK: [2022-09-28 Wed 07:31]--[2022-09-28 Wed 08:32] =>  1:01
necesito enfocar: trabajar sobre un solo tema: buscador para optimizar
la busqueda y la presentacion de los datos.
primero condonacion.
descubri antiguo bug de pq no se actualizaban los saldos
inmediatamente y es que usaba buscaCuentaporDni que toma los datos del
cliente de la lista leida antes de los cambios, se debe usar buscarCliente
:END:
*** [2022-09-27 Tue]
:LOGBOOK:
CLOCK: [2022-09-27 Tue 20:33]--[2022-09-27 Tue 21:33] =>  1:00
CLOCK: [2022-09-27 Tue 19:49]--[2022-09-27 Tue 20:29] =>  0:40
free hour
CLOCK: [2022-09-27 Tue 17:20]--[2022-09-27 Tue 17:46] =>  0:26
corrigiendo bugs
CLOCK: [2022-09-27 Tue 15:52]--[2022-09-27 Tue 17:18] =>  1:26
termino de afinar la busqueda en especial el uso de tags.
CLOCK: [2022-09-27 Tue 14:54]--[2022-09-27 Tue 15:24] =>  0:30
CLOCK: [2022-09-27 Tue 11:40]--[2022-09-27 Tue 14:27] =>  2:47
refinando los metodos de busqueda y cambie el cuadro de vista
agregando un table
CLOCK: [2022-09-27 Tue 11:25]--[2022-09-27 Tue 11:40] =>  0:15
bug en el sitio mobile- arreglado
CLOCK: [2022-09-27 Tue 10:23]--[2022-09-27 Tue 11:19] =>  0:56
busqueda mejorada-> agregue busquedas por id por wapp por acla y
respuestas personalizadas. Visualizo en desktop solo una barra de
busqueda. pq las otras dos son para trabajo en la calle.
CLOCK: [2022-09-27 Tue 08:58]--[2022-09-27 Tue 10:10] =>  1:12
termino de probar asientos e instalar en la web
CLOCK: [2022-09-27 Tue 08:30]--[2022-09-27 Tue 08:57] =>  0:27
agregue ido vertical mode a emacs y rg
:END:
*** [2022-09-26 Mon]
   :LOGBOOK:
   CLOCK: [2022-09-26 Mon 19:22]--[2022-09-26 Mon 20:14] =>  0:52
   cambiar los botones feos por awesome y otros retoques incluso
   cambie los themes por defecto.
   CLOCK: [2022-09-26 Mon 18:45]--[2022-09-26 Mon 19:01] =>  0:16
   CLOCK: [2022-09-26 Mon 18:30]--[2022-09-26 Mon 18:45] =>  0:15
   CLOCK: [2022-09-26 Mon 17:30]--[2022-09-26 Mon 18:24] =>  0:54
   me dispongo a tunear emacs que le voy a hacer
   lo aliviane lo maximo que pude y veremos que pasa.
   CLOCK: [2022-09-26 Mon 16:30]--[2022-09-26 Mon 16:59] =>  0:29
   CLOCK: [2022-09-26 Mon 15:43]--[2022-09-26 Mon 16:01] =>  0:18
   encaro la instalacion de la impresora
   CLOCK: [2022-09-26 Mon 14:31]--[2022-09-26 Mon 15:43] =>  1:12
   terminado asientos
   CLOCK: [2022-09-26 Mon 13:17]--[2022-09-26 Mon 14:30] => 1:13
   CLOCK: [2022-09-26 Mon 11:11]--[2022-09-26 Mon 13:01] => 1:50
   arreglo la vista asientos
   CLOCK: [2022-09-26 Mon 09:40]--[2022-09-26 Mon 11:10] => 1:30
   comienzo proyecto reforma contable
   terminado el crud cuentas
   CLOCK: [2022-09-26 Mon 08:57]--[2022-09-26 Mon 09:39] => 0:42
   termino de poner a punto vim con folder y Files global y Rg
   :END:
*** [2022-09-25 Sun]
   :LOGBOOK:
   CLOCK: [2022-09-25 Sun 18:30]--[2022-09-25 Sun 21:15] => 2:45
   optimizacion de vim - instalacion de kitty - conf.
   arreglo de bug de org-return
   CLOCK: [2022-09-25 Sun 09:56]--[2022-09-25 Sun 10:48] => 0:52
   :END:
** semana [2022-09-18 Sun]
*** [2022-09-24 Sat]
:LOGBOOK:
CLOCK: [2022-09-24 Sat 21:46]--[2022-09-24 Sat 22:35] => 0:49
   lamentablemente descubro que el enfoque de queue con clase
   no sirve pq aunque anda bien en un solo browser no anda en un ambiente de
   mas de un browser. Manana soluciono los branchs y vuelvo al whatalt2.
CLOCK: [2022-09-24 Sat 20:14]--[2022-09-24 Sat 21:00] => 0:46
   sigo tuneando vim. es una locura el hell que me agarro.
CLOCK: [2022-09-24 Sat 19:07]--[2022-09-24 Sat 20:04] => 0:57
   me hizo renegar el mapping de orgmode y telescope
CLOCK: [2022-09-24 Sat 16:14]--[2022-09-24 Sat 19:06] => 2:52
   vim hell al mango con org incluido!!!
CLOCK: [2022-09-24 Sat 14:40]--[2022-09-24 Sat 16:14] => 1:34
CLOCK: [2022-09-24 Sat 13:08]--[2022-09-24 Sat 13:59] =>  0:51
volviendo a nvim
CLOCK: [2022-09-24 Sat 12:25]--[2022-09-24 Sat 13:08] =>  0:43
CLOCK: [2022-09-24 Sat 10:10]--[2022-09-24 Sat 11:43] =>  1:33
terminado queue con class
CLOCK: [2022-09-24 Sat 10:01]--[2022-09-24 Sat 10:06] =>  0:05
probando otro sistema queue basado en clases
CLOCK: [2022-09-24 Sat 08:24]--[2022-09-24 Sat 09:41] =>  1:17
termine listado con dos formatos- hice el merge -
:END:
*** [2022-09-23 Fri]
:LOGBOOK:
CLOCK: [2022-09-23 Fri 17:44]--[2022-09-23 Fri 18:20] =>  0:36
terminado el queue - trabaje un poco en el orden de columnas de wapplog
CLOCK: [2022-09-23 Fri 15:48]--[2022-09-23 Fri 17:20] =>  1:32
probando el nuevo queue problemas con el libredeuda
CLOCK: [2022-09-23 Fri 14:00]--[2022-09-23 Fri 15:17] =>  1:17
haciendo listado nuevo
CLOCK: [2022-09-23 Fri 13:12]--[2022-09-23 Fri 13:43] =>  0:31
CLOCK: [2022-09-23 Fri 11:10]--[2022-09-23 Fri 12:35] =>  1:25
CLOCK: [2022-09-23 Fri 09:20]--[2022-09-23 Fri 10:45] =>  1:25
exitoso por el momento
CLOCK: [2022-09-23 Fri 09:16]--[2022-09-23 Fri 09:19] =>  0:03
voy a encarar un nuevo enfoque con la queue de whatsapp
CLOCK: [2022-09-23 Fri 08:50]--[2022-09-23 Fri 09:12] =>  0:22
solucione el problema de los archivos undo-tree
:END:
*** [2022-09-22 Thu]
:LOGBOOK:
CLOCK: [2022-09-22 Thu 17:07]--[2022-09-22 Thu 18:07] =>  1:00
subida la rama whatalt1 y prueba y correccion
CLOCK: [2022-09-22 Thu 15:35]--[2022-09-22 Thu 16:58] =>  1:23
refactorizacion de lib.py para flake y buscar.html
CLOCK: [2022-09-22 Thu 15:28]--[2022-09-22 Thu 15:34] =>  0:06
CLOCK: [2022-09-22 Thu 14:25]--[2022-09-22 Thu 14:53] =>  0:28
trasteo de nuevo con emacs.d/init.el
CLOCK: [2022-09-22 Thu 13:31]--[2022-09-22 Thu 14:17] =>  0:46
tedioso trabajo de arreglar refactorizar buscar.html
CLOCK: [2022-09-22 Thu 13:02]--[2022-09-22 Thu 13:31] =>  0:29
CLOCK: [2022-09-22 Thu 10:49]--[2022-09-22 Thu 12:18] =>  1:29
trabaje sobre intimarpdf para que sea nominada
CLOCK: [2022-09-22 Thu 08:53]--[2022-09-22 Thu 09:53] =>  1:00
otra version de la cola de wapps
CLOCK: [2022-09-22 Thu 08:21]--[2022-09-22 Thu 08:50] =>  0:29
trasteando el init.el
:END:
*** [2022-09-21 Wed]
:LOGBOOK:
CLOCK: [2022-09-21 Wed 19:57]--[2022-09-21 Wed 21:18] =>  1:21
nuevo enfoque en el delay de los wapps
CLOCK: [2022-09-21 Wed 19:47]--[2022-09-21 Wed 19:55] =>  0:08
CLOCK: [2022-09-21 Wed 18:33]--[2022-09-21 Wed 19:27] =>  0:54
CLOCK: [2022-09-21 Wed 15:00]--[2022-09-21 Wed 16:59] =>  1:59
termine rbotransferencia; hice utilidades/pdfsistema
CLOCK: [2022-09-21 Wed 13:35]--[2022-09-21 Wed 14:52] =>  1:17
continuo con la limpieza de buscar.html; inicio la refactorizacion de
rboportransferencia
CLOCK: [2022-09-21 Wed 12:00]--[2022-09-21 Wed 13:32] =>  1:32
terminado el envio de bajas a whatsapp
CLOCK: [2022-09-21 Wed 10:24]--[2022-09-21 Wed 11:41] =>  1:17
trabajo en el tema mensaje de invalid whatsapp
CLOCK: [2022-09-21 Wed 10:02]--[2022-09-21 Wed 10:13] =>  0:11
CLOCK: [2022-09-21 Wed 09:54]--[2022-09-21 Wed 09:56] =>  0:02
CLOCK: [2022-09-21 Wed 09:49]--[2022-09-21 Wed 09:53] =>  0:04
CLOCK: [2022-09-21 Wed 09:35]--[2022-09-21 Wed 09:48] =>  0:13
obtengo error en evil-mode en insert-mode con la tecla braceright.
CLOCK: [2022-09-21 Wed 08:28]--[2022-09-21 Wed 09:28] =>  1:00
optimizacion de teclado gringo para trabajar minimamente ya que no
pude hacerlo con el latam. Resigne la - en el menique.
:END:
*** [2022-09-20 Tue]
:LOGBOOK:
CLOCK: [2022-09-20 Tue 20:45]--[2022-09-20 Tue 22:00] =>  1:15
busqueda de otro reemplazo que sea mas seguro
CLOCK: [2022-09-20 Tue 20:25]--[2022-09-20 Tue 20:45] =>  0:20
CLOCK: [2022-09-20 Tue 18:30]--[2022-09-20 Tue 20:24] =>  1:54
busqueda de reemplazo de xmodmap: encontrado!!!!
es input-remapper y trabaja hasta ahora bastante bien, veremos
demore pero es una cuestion ergonomica fundamental que me ha hecho
sufrir mucho en estos ultimos dias el teclado gringo.
CLOCK: [2022-09-20 Tue 18:21]--[2022-09-20 Tue 18:30] =>  0:09
busqueda de funcionalidades de evil-mode
CLOCK: [2022-09-20 Tue 12:14]--[2022-09-20 Tue 12:43] =>  0:29
capturar como res el response.text y ver si el wapp es invalid
y dar msg acorde en js
CLOCK: [2022-09-20 Tue 11:05]--[2022-09-20 Tue 12:14] =>  1:09
perdida de tiempo para encontrar la vuelta a evil-mode
CLOCK: [2022-09-20 Tue 10:47]--[2022-09-20 Tue 11:04] =>  0:17
CLOCK: [2022-09-20 Tue 09:25]--[2022-09-20 Tue 10:24] =>  0:59
CLOCK: [2022-09-20 Tue 09:13]--[2022-09-20 Tue 09:22] =>  0:09
excurso emacs para probar otro modal
CLOCK: [2022-09-20 Tue 08:34]--[2022-09-20 Tue 08:49] =>  0:15
arreglar urgente bug de impresion fichas
:END:
*** [2022-09-19 Mon]
:LOGBOOK:
CLOCK: [2022-09-19 Mon 21:20]--[2022-09-19 Mon 23:49] =>  2:29
CLOCK: [2022-09-19 Mon 17:32]--[2022-09-19 Mon 20:50] =>  3:18
CLOCK: [2022-09-19 Mon 17:10]--[2022-09-19 Mon 17:31] =>  0:21
resuelto el bug pasarplanillas resulto ser una multiplicacion de int
con str en la preparacion de un insert en python. Se destaca el
descubrimiento del log1 que te muestra la salida de gunicorn sino no
hubiera podido hacer nada.
CLOCK: [2022-09-19 Mon 15:11]--[2022-09-19 Mon 16:40] =>  1:29
gran problema rastreando el bug pasarplanillas
CLOCK: [2022-09-19 Mon 15:24]--[2022-09-19 Mon 16:41] =>  1:17
CLOCK: [2022-09-19 Mon 14:17]--[2022-09-19 Mon 15:10] =>  0:53
se intenta solucionar el bug de nginx con los whatsapp
se intenta tomar el rastro de los numeros inactivos
se intenta hacer una cola general para los requests
CLOCK: [2022-09-19 Mon 12:13]--[2022-09-19 Mon 13:50] =>  1:37
analizar bug a pedido de ndryon
CLOCK: [2022-09-19 Mon 11:12]--[2022-09-19 Mon 12:13] =>  1:01
CLOCK: [2022-09-19 Mon 10:53]--[2022-09-19 Mon 11:12] =>  0:19
agregar mas mensajes programables y poner un dropdown
:END:
** semana [2022-09-11 Sun]
*** [2022-09-17 sáb]
   :LOGBOOK:
   CLOCK: [2022-09-17 sáb 18:47]--[2022-09-17 Sat 19:52] =>  1:05
   de emergencia un chequeo al envio de libre deuda si la cuenta esta cancelada
   CLOCK: [2022-09-17 sáb 15:05]--[2022-09-17 sáb 15:41] =>  0:36
   busqueda de optimizacion de emacs (fallida)
   CLOCK: [2022-09-17 sáb 14:30]--[2022-09-17 sáb 15:01] =>  0:31
   CLOCK: [2022-09-17 sáb 12:45]--[2022-09-17 sáb 13:09] =>  0:24
   arreglos en emacs
   CLOCK: [2022-09-17 sáb 11:48]--[2022-09-17 sáb 12:44] =>  0:56
   arregle el acceso de adminer a la base de datos. Me hizo renegar un
   monton.
   CLOCK: [2022-09-17 sáb 11:05]--[2022-09-17 sáb 11:33] =>  0:28
   carge todos los codigos y grupos a la tabla articulos
   CLOCK: [2022-09-17 sáb 10:43]--[2022-09-17 sáb 11:01] =>  0:18
   pasado a hoverable y arreglado las importaciones .lib
   CLOCK: [2022-09-17 sáb 09:59]--[2022-09-17 sáb 10:14] =>  0:15
   pasar a is-hoverable -- urgente arreglar los .lib
   CLOCK: [2022-09-17 sáb 09:00]--[2022-09-17 sáb 09:30] =>  0:30
   resolviendo un bug. Los whatsapp se entregan pero dan codigo 500 y
   por lo tanto dan notificacion erronea
   Bug resuelto: era que no habia creado el directorio ~/log para el
   log de wapps. Por el momento se encuentra el log de debug en
   systemctl status app.
   CLOCK: [2022-09-17 sáb 07:39]--[2022-09-17 sáb 09:00] =>  1:21
   inicio el cambio de servidor a nginx.
   se hizo un servidor espejo en pachito.xyz.
   se reinicio el servidor fedesal.lol
   se instalo de nuevo debian 10
   se instalo todo con nginx
   :END:
*** [2022-09-16 vie]
   :LOGBOOK:
   CLOCK: [2022-09-16 vie 17:54]--[2022-09-16 vie 18:08] =>  0:14
   CLOCK: [2022-09-16 vie 16:51]--[2022-09-16 vie 17:38] =>  0:47
   CLOCK: [2022-09-16 vie 16:10]--[2022-09-16 vie 16:44] =>  0:34
   implementacion de bulma-dropdowns en buscar.html
   CLOCK: [2022-09-16 vie 14:10]--[2022-09-16 vie 15:59] =>  1:49
   optimizacion de emacs
   CLOCK: [2022-09-16 vie 12:29]--[2022-09-16 vie 13:33] =>  1:04
   agregado funcionalidad de codigo de articulos en ventas y salida de
   mercaderia y en lista de precios
   CLOCK: [2022-09-16 vie 09:57]--[2022-09-16 vie 11:23] =>  1:26
   hice fk en tablas artcomprado/detvta/detallesalida para que los art
   se actualicen en cascada y para que la tabla articulo sea realmente
   la mandatory respecto a los articulos.
   CLOCK: [2022-09-16 vie 08:12]--[2022-09-16 vie 09:02] =>  0:50
   terminado el cobrado/estimado en planilla recibo
   :END:
*** [2022-09-15 jue]
   :LOGBOOK:
   CLOCK: [2022-09-15 jue 20:10]--[2022-09-15 jue 20:31] =>  0:21
   CLOCK: [2022-09-15 jue 17:05]--[2022-09-15 jue 17:37] =>  0:32
   bug irresuelto: no funciona en server pero si en local: imprimir
   listagenerada. Termino siendo problema de cache. Al tener el mismo
   nombre el browser usa el cache. tuve que agregarle una terminacion
   aleatoria con time.
   CLOCK: [2022-09-15 jue 14:45]--[2022-09-15 jue 16:11] =>  1:26
   hice manejo de error para los whatsapp en caso de no tener whatsapp
   y no tener repuesta 200, tambien hice un log.
   CLOCK: [2022-09-15 jue 12:34]--[2022-09-15 jue 13:18] =>  0:44
   CLOCK: [2022-09-15 jue 11:05]--[2022-09-15 jue 12:21] =>  1:16
   lista de precios automatica
   CLOCK: [2022-09-15 jue 10:04]--[2022-09-15 jue 10:50] =>  0:46
   CLOCK: [2022-09-15 jue 08:16]--[2022-09-15 jue 09:30] =>  1:14
   termine de revisar todo el codigo de articulos.html cambiando todo
   a alpine-js y a Swall, simplificando las funciones lo mas posible.
   CLOCK: [2022-09-15 jue 08:04]--[2022-09-15 jue 08:16] =>  0:12
   corregi problema de pachito agregando crontab para el restart del
   servicio como esta hecho en apache, e hice que el backup se haga
   por hora.
   :END:
* agenda
**** llevar bici fede
**** comprar agua kangoo
**** llevar kangoo mecanico
**** inflar gomas kangoo
**** comprar guantes carla
**** arreglar fibertel vencio la promocion
**** pagar impuesto kangoo en ag
